{
  "compliance": {
    "Company Policies": [
      "What are the key company policies I need to know?",
      "How do I report a policy violation?",
      "What is the code of conduct?",
      "Where can I find the employee handbook?",
      "What are the attendance and leave policies?"
    ],
    "Data Privacy & GDPR": [
      "What is GDPR and how does it affect our work?",
      "How should I handle customer personal data?",
      "What are the data retention policies?",
      "How do I respond to a data subject access request?",
      "What constitutes a data breach and how do I report it?"
    ],
    "Workplace Safety": [
      "What are the emergency evacuation procedures?",
      "How do I report a workplace safety hazard?",
      "What PPE is required for different areas?",
      "What are the first aid procedures?",
      "How do I file a workplace injury report?"
    ],
    "Anti-Harassment": [
      "What constitutes workplace harassment?",
      "How do I report a harassment incident?",
      "What protections exist for whistleblowers?",
      "What is the investigation process for complaints?",
      "What are the consequences of harassment violations?"
    ],
    "Ethics & Conduct": [
      "What are the ethical guidelines for client interactions?",
      "How do I handle conflicts of interest?",
      "What is the gift and entertainment policy?",
      "How do I report unethical behavior?",
      "What are the insider trading regulations?"
    ]
  },
  "security": {
    "Cybersecurity Basics": [
      "What are the top cybersecurity threats to be aware of?",
      "How should I secure my work devices?",
      "What is multi-factor authentication?",
      "How do I recognize a potential security threat?",
      "What are the company's approved software applications?"
    ],
    "Phishing Prevention": [
      "How do I identify a phishing email?",
      "What should I do if I click a suspicious link?",
      "What are common social engineering tactics?",
      "How do I verify a legitimate communication?",
      "How do I report a suspected phishing attempt?"
    ],
    "Password Management": [
      "What are the password requirements?",
      "How often should I change my password?",
      "What password manager tools are approved?",
      "Why shouldn't I reuse passwords across systems?",
      "How do I set up a strong passphrase?"
    ],
    "Incident Reporting": [
      "How do I report a security incident?",
      "What is the incident response timeline?",
      "Who should I contact for security concerns?",
      "What information should I include in an incident report?",
      "What are the escalation procedures?"
    ]
  },
  "leadership": {
    "Team Management": [
      "How do I set effective team goals?",
      "What are best practices for one-on-one meetings?",
      "How do I manage remote team members?",
      "What tools should I use for team collaboration?",
      "How do I handle underperforming team members?"
    ],
    "Communication Skills": [
      "How do I give constructive feedback?",
      "What are effective presentation techniques?",
      "How do I write professional business emails?",
      "What are active listening best practices?",
      "How do I communicate organizational changes?"
    ],
    "Conflict Resolution": [
      "How do I mediate team conflicts?",
      "What is the conflict resolution framework?",
      "When should I escalate a conflict to HR?",
      "How do I prevent workplace conflicts?",
      "What are the steps for a difficult conversation?"
    ]
  },
  "technical": {
    "Tools & Systems": [
      "How do I access the company CRM system?",
      "What are the approved collaboration tools?",
      "How do I set up my development environment?",
      "Where do I find technical documentation?",
      "How do I request access to new systems?"
    ],
    "Process Documentation": [
      "How do I document a new process?",
      "What template should I use for SOPs?",
      "How do I update existing documentation?",
      "What is the review process for procedures?",
      "How do I create a process flowchart?"
    ],
    "Quality Standards": [
      "What quality standards do we follow?",
      "How do I perform a quality audit?",
      "What are the acceptance criteria for deliverables?",
      "How do I report quality issues?",
      "What continuous improvement methods do we use?"
    ]
  }
}
